moneymatters_rails/app/controllers/accounts_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1  ORDER BY id ASC  [["user_id", 1]]
---
	def index
		@accounts = current_user.accounts.all.order("id ASC")

SELECT "transactions".* FROM "transactions" WHERE "transactions"."account_id" = $1  [["account_id", 13]]
---
	def show
		@transaction = @account.transactions.all

INSERT INTO "accounts" ("name", "bank", "account_number", "balance", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Echo China Checking"], ["bank", "Bank of China"], ["account_number", 9876543], ["balance", 9876.0], ["user_id", 2]]
---
	def create
		@account = current_user.accounts.new (account_params)
		if @account.save

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1 AND "accounts"."id" = $2 LIMIT 1  [["user_id", 2], ["id", 8]]
---
		def find_account
			@account = current_user.accounts.find( params[:id] )