moneymatters_rails/app/controllers/transactions_controller.rb

	def create
		@transaction = @account.transactions.new( transaction_params )
		if @transaction.save
---
INSERT INTO "transactions" ("credit", "payee", "date", "category", "account_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["credit", 1000000.0], ["payee", "General Assembly"], ["date", "04/15/15"], ["category", "income"], ["account_id", 1]]

	def edit
		@transaction = Transaction.find( params[:id])
---
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT 1  [["id", 1]]

	def update
		@transaction = @account.transactions.find(params[:id])
---
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."account_id" = $1 AND "transactions"."id" = $2 LIMIT 1  [["account_id", 1], ["id", 1]]

	def destroy
		@transaction = @account.transactions.find(params[:id])
		@transaction.destroy
---
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."account_id" = $1 AND "transactions"."id" = $2 LIMIT 1  [["account_id", 1], ["id", 10]]
DELETE FROM "transactions" WHERE "transactions"."id" = $1  [["id", 10]]

		def find_account
			@account = Account.find( params[:account_id] )
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT 1  [["id", 1]]