moneymatters_rails/app/views/accounts/show.html.erb

SELECT "transactions".* FROM "transactions" WHERE "transactions"."account_id" = $1  [["account_id", 13]]
---

<% @account.transactions.each do |transaction| %>