app/controllers/accounts_controller.rb

SELECT "accounts".* FROM "accounts"  ORDER BY id DESC
---
	def index
		@accounts = Account.all.order("id ASC")

SELECT "transactions".* FROM "transactions" WHERE "transactions"."account_id" = $1  [["account_id", 13]]
---
	def show
		@transaction = @account.transactions.all

INSERT INTO "accounts" ("name", "bank", "account_number", "balance") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "New Account"], ["bank", "Bank of America"], ["account_number", 1230987], ["balance", 100000.0]]
---
	def create
		@account = Account.new (account_params)
		if @account.save

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT 1  [["id", 13]]
---
		def find_account
			@account = Account.find( params[:id] )